БылковДА_70180166/src/Documents/ВедомостьОСистемеАкадемическихЗадолженностей/ВедомостьОСистемеАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьОСистемеАкадемическихЗадолженностей</name>
  <basedOn>Document.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусАкадемическойЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
</mdclass:Document>

БылковДА_70180166/src/Documents/ВедомостьОСистемеАкадемическихЗадолженностей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОценкиСтудентов.Записывать = Истина;
	Для Каждого ТекСтрокаРезультатЗаседанияКомиссии Из РезультатЗаседанияКомиссии Цикл
		Движение = Движения.ОценкиСтудентов.Добавить();
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаРезультатЗаседанияКомиссии.Студент;
		Движение.Группа = ТекСтрокаРезультатЗаседанияКомиссии.Группа;
		Движение.Дисциплина = ТекСтрокаРезультатЗаседанияКомиссии.Дисциплина;
		Движение.ВидКонтроля = ТекСтрокаРезультатЗаседанияКомиссии.ВидКонтроля;
		Движение.Преподаватель = Преподаватель;
		Движение.Оценка = ТекСтрокаРезультатЗаседанияКомиссии.Оценка;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НаправлениеНаПересдачу") Тогда
		
	КонецЕсли;
	
КонецПроцедуры
